{
    "broadArea": {
        "name": "Computer Science and Engineering",
        "link": "http://vlab.co.in/broad-area-computer-science-and-engineering",
        "code": "CSE"
    },
    "lab": "Discrete Mathematics - I",
    "lab_display_name": "Discrete Mathematics - I",
    "phase": 3,
    "collegeName": "IIITH",
    "baseUrl": "dm1-iiith.vlabs.ac.in",
    "introduction": "Discrete Mathematics - I establishes the fundamental building blocks of discrete mathematics, focusing on relations, logic, and counting principles that underpin computer science theory. Through interactive experiments, students explore how mathematical structures model relationships in data, reason about computational problems, and analyze algorithmic complexity. This lab emphasizes the transition from intuitive understanding to formal reasoning, introducing students to the precision required in mathematical proofs and algorithm design. Topics range from ordering and equivalence relations to the foundational concepts of logic, recursion, and combinatorics, each serving as essential tools for understanding computational structures and theoretical computer science.",
    "experiments": [
        {
            "name": "Partial Order and Hasse Diagram",
            "short-name": "hasse-diagram",
            "repo": "https://github.com/virtual-labs/exp-hasse-diagram-iiith",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Equivalence Relation",
            "short-name": "equivalence-relation",
            "repo": "https://github.com/virtual-labs/exp-equivalence-relation-iiith",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Diagonalization",
            "short-name": "diagonalization",
            "repo": "https://github.com/virtual-labs/exp-diagonalization-iiith",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Binomial Coefficients, Pascal’s Triangle",
            "short-name": "pascals-triangle",
            "repo": "https://github.com/virtual-labs/exp-pascals-triangle-iiith",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Propositional Logic: Syntax and Inference",
            "short-name": "syntax-inference",
            "repo": "https://github.com/virtual-labs/exp-syntax-and-inference-iiith",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Propositional Logic: Semantics and Satisfiability",
            "short-name": "semantics-satisfiability",
            "repo": "https://github.com/virtual-labs/exp-semantics-and-satisfiability-iiith",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Recursion",
            "short-name": "recursion",
            "repo": "https://github.com/virtual-labs/exp-recursion-discrete-mathematics-iiith",
            "tag": "v1.0.0",
            "deploy": true
        }
    ],
    "targetAudience": {
        "UG": [
            "2nd Year (4th semester)"
        ]
    },
    "objective": "<ul><li>Master Fundamental Relations: Understand partial orders, equivalence relations, and their visual representations through Hasse diagrams, establishing foundations for data structures, algorithm analysis, and database design.</li><li>Develop Logical Reasoning: Gain proficiency in propositional logic syntax, inference rules, semantics, and satisfiability, building skills essential for formal verification, circuit design, and automated reasoning.</li><li>Explore Cardinality and Infinity: Investigate Cantor’s diagonalization to comprehend different sizes of infinity and countability, fundamental concepts in computability theory and theoretical computer science.</li><li>Apply Combinatorial Thinking: Master binomial coefficients and Pascal’s triangle to analyze counting problems, probability distributions, and algorithm complexity in computational contexts.</li><li>Understand Recursive Structures: Develop intuition for recursion through interactive experiments, preparing for recursive algorithm design, inductive proofs, and analysis of recurrence relations.</li></ul>",
    "courseAlignment": {
        "description": "Discrete Mathematics is a professional core course in Computer Science and Engineering.",
        "universities": [
            "(PCC-CS401) recommended in the AICTE model curriculum"
        ]
    }
}
